ataradov/mcu-starter-projects/samg53/include/component/matrix.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MATRIX_PRAS1_OFFSET                 (0x88)                                        /**<  (MATRIX_PRAS1) Priority Register A for Slave 1  Offset */

#define MATRIX_PRAS1_M0PR_Pos               0                                              /**< (MATRIX_PRAS1) Master 0 Priority Position */
#define MATRIX_PRAS1_M0PR_Msk               (_U_(0x3) << MATRIX_PRAS1_M0PR_Pos)            /**< (MATRIX_PRAS1) Master 0 Priority Mask */
#define MATRIX_PRAS1_M0PR(value)            (MATRIX_PRAS1_M0PR_Msk & ((value) << MATRIX_PRAS1_M0PR_Pos))
#define MATRIX_PRAS1_M1PR_Pos               4                                              /**< (MATRIX_PRAS1) Master 1 Priority Position */
#define MATRIX_PRAS1_M1PR_Msk               (_U_(0x3) << MATRIX_PRAS1_M1PR_Pos)            /**< (MATRIX_PRAS1) Master 1 Priority Mask */
#define MATRIX_PRAS1_M1PR(value)            (MATRIX_PRAS1_M1PR_Msk & ((value) << MATRIX_PRAS1_M1PR_Pos))
#define MATRIX_PRAS1_M2PR_Pos               8                                              /**< (MATRIX_PRAS1) Master 2 Priority Position */
#define MATRIX_PRAS1_M2PR_Msk               (_U_(0x3) << MATRIX_PRAS1_M2PR_Pos)            /**< (MATRIX_PRAS1) Master 2 Priority Mask */
#define MATRIX_PRAS1_M2PR(value)            (MATRIX_PRAS1_M2PR_Msk & ((value) << MATRIX_PRAS1_M2PR_Pos))
#define MATRIX_PRAS1_M3PR_Pos               12                                             /**< (MATRIX_PRAS1) Master 3 Priority Position */
#define MATRIX_PRAS1_M3PR_Msk               (_U_(0x3) << MATRIX_PRAS1_M3PR_Pos)            /**< (MATRIX_PRAS1) Master 3 Priority Mask */
#define MATRIX_PRAS1_M3PR(value)            (MATRIX_PRAS1_M3PR_Msk & ((value) << MATRIX_PRAS1_M3PR_Pos))
#define MATRIX_PRAS1_MASK                   _U_(0x3333)                                    /**< \deprecated (MATRIX_PRAS1) Register MASK  (Use MATRIX_PRAS1_Msk instead)  */
#define MATRIX_PRAS1_Msk                    _U_(0x3333)                                    /**< (MATRIX_PRAS1) Register Mask  */


/* -------- MATRIX_PRAS2 : (MATRIX Offset: 0x90) (R/W 32) Priority Register A for Slave 2 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t M0PR:2;                    /**< bit:   0..1  Master 0 Priority                        */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t M1PR:2;                    /**< bit:   4..5  Master 1 Priority                        */
    uint32_t :2;                        /**< bit:   6..7  Reserved */
    uint32_t M2PR:2;                    /**< bit:   8..9  Master 2 Priority                        */
    uint32_t :2;                        /**< bit: 10..11  Reserved */
    uint32_t M3PR:2;                    /**< bit: 12..13  Master 3 Priority                        */
    uint32_t :18;                       /**< bit: 14..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MATRIX_PRAS2_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MATRIX_PRAS2_OFFSET                 (0x90)                                        /**<  (MATRIX_PRAS2) Priority Register A for Slave 2  Offset */

#define MATRIX_PRAS2_M0PR_Pos               0                                              /**< (MATRIX_PRAS2) Master 0 Priority Position */
#define MATRIX_PRAS2_M0PR_Msk               (_U_(0x3) << MATRIX_PRAS2_M0PR_Pos)            /**< (MATRIX_PRAS2) Master 0 Priority Mask */
#define MATRIX_PRAS2_M0PR(value)            (MATRIX_PRAS2_M0PR_Msk & ((value) << MATRIX_PRAS2_M0PR_Pos))
#define MATRIX_PRAS2_M1PR_Pos               4                                              /**< (MATRIX_PRAS2) Master 1 Priority Position */
#define MATRIX_PRAS2_M1PR_Msk               (_U_(0x3) << MATRIX_PRAS2_M1PR_Pos)            /**< (MATRIX_PRAS2) Master 1 Priority Mask */
#define MATRIX_PRAS2_M1PR(value)            (MATRIX_PRAS2_M1PR_Msk & ((value) << MATRIX_PRAS2_M1PR_Pos))
#define MATRIX_PRAS2_M2PR_Pos               8                                              /**< (MATRIX_PRAS2) Master 2 Priority Position */
#define MATRIX_PRAS2_M2PR_Msk               (_U_(0x3) << MATRIX_PRAS2_M2PR_Pos)            /**< (MATRIX_PRAS2) Master 2 Priority Mask */
#define MATRIX_PRAS2_M2PR(value)            (MATRIX_PRAS2_M2PR_Msk & ((value) << MATRIX_PRAS2_M2PR_Pos))
#define MATRIX_PRAS2_M3PR_Pos               12                                             /**< (MATRIX_PRAS2) Master 3 Priority Position */
#define MATRIX_PRAS2_M3PR_Msk               (_U_(0x3) << MATRIX_PRAS2_M3PR_Pos)            /**< (MATRIX_PRAS2) Master 3 Priority Mask */
#define MATRIX_PRAS2_M3PR(value)            (MATRIX_PRAS2_M3PR_Msk & ((value) << MATRIX_PRAS2_M3PR_Pos))
#define MATRIX_PRAS2_MASK                   _U_(0x3333)                                    /**< \deprecated (MATRIX_PRAS2) Register MASK  (Use MATRIX_PRAS2_Msk instead)  */
#define MATRIX_PRAS2_Msk                    _U_(0x3333)                                    /**< (MATRIX_PRAS2) Register Mask  */


/* -------- MATRIX_PRAS3 : (MATRIX Offset: 0x98) (R/W 32) Priority Register A for Slave 3 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t M0PR:2;                    /**< bit:   0..1  Master 0 Priority                        */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t M1PR:2;                    /**< bit:   4..5  Master 1 Priority                        */
    uint32_t :2;                        /**< bit:   6..7  Reserved */
    uint32_t M2PR:2;                    /**< bit:   8..9  Master 2 Priority                        */
    uint32_t :2;                        /**< bit: 10..11  Reserved */
    uint32_t M3PR:2;                    /**< bit: 12..13  Master 3 Priority                        */
    uint32_t :18;                       /**< bit: 14..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MATRIX_PRAS3_Type;
