ataradov/mcu-starter-projects/samg53/include/component/matrix.h
/* -------- MATRIX_WPMR : (MATRIX Offset: 0x1e4) (R/W 32) Write Protection Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                  */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MATRIX_WPMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MATRIX_WPMR_OFFSET                  (0x1E4)                                       /**<  (MATRIX_WPMR) Write Protection Mode Register  Offset */

#define MATRIX_WPMR_WPEN_Pos                0                                              /**< (MATRIX_WPMR) Write Protection Enable Position */
#define MATRIX_WPMR_WPEN_Msk                (_U_(0x1) << MATRIX_WPMR_WPEN_Pos)             /**< (MATRIX_WPMR) Write Protection Enable Mask */
#define MATRIX_WPMR_WPEN                    MATRIX_WPMR_WPEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MATRIX_WPMR_WPEN_Msk instead */
#define MATRIX_WPMR_WPKEY_Pos               8                                              /**< (MATRIX_WPMR) Write Protection Key Position */
#define MATRIX_WPMR_WPKEY_Msk               (_U_(0xFFFFFF) << MATRIX_WPMR_WPKEY_Pos)       /**< (MATRIX_WPMR) Write Protection Key Mask */
#define MATRIX_WPMR_WPKEY(value)            (MATRIX_WPMR_WPKEY_Msk & ((value) << MATRIX_WPMR_WPKEY_Pos))
#define   MATRIX_WPMR_WPKEY_PASSWD_Val      _U_(0x4D4154)                                  /**< (MATRIX_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define MATRIX_WPMR_WPKEY_PASSWD            (MATRIX_WPMR_WPKEY_PASSWD_Val << MATRIX_WPMR_WPKEY_Pos)  /**< (MATRIX_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define MATRIX_WPMR_MASK                    _U_(0xFFFFFF01)                                /**< \deprecated (MATRIX_WPMR) Register MASK  (Use MATRIX_WPMR_Msk instead)  */
#define MATRIX_WPMR_Msk                     _U_(0xFFFFFF01)                                /**< (MATRIX_WPMR) Register Mask  */


/* -------- MATRIX_WPSR : (MATRIX Offset: 0x1e8) (R/ 32) Write Protection Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status        */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protection Violation Source        */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MATRIX_WPSR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MATRIX_WPSR_OFFSET                  (0x1E8)                                       /**<  (MATRIX_WPSR) Write Protection Status Register  Offset */

#define MATRIX_WPSR_WPVS_Pos                0                                              /**< (MATRIX_WPSR) Write Protection Violation Status Position */
#define MATRIX_WPSR_WPVS_Msk                (_U_(0x1) << MATRIX_WPSR_WPVS_Pos)             /**< (MATRIX_WPSR) Write Protection Violation Status Mask */
#define MATRIX_WPSR_WPVS                    MATRIX_WPSR_WPVS_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MATRIX_WPSR_WPVS_Msk instead */
#define MATRIX_WPSR_WPVSRC_Pos              8                                              /**< (MATRIX_WPSR) Write Protection Violation Source Position */
#define MATRIX_WPSR_WPVSRC_Msk              (_U_(0xFFFF) << MATRIX_WPSR_WPVSRC_Pos)        /**< (MATRIX_WPSR) Write Protection Violation Source Mask */
#define MATRIX_WPSR_WPVSRC(value)           (MATRIX_WPSR_WPVSRC_Msk & ((value) << MATRIX_WPSR_WPVSRC_Pos))
#define MATRIX_WPSR_MASK                    _U_(0xFFFF01)                                  /**< \deprecated (MATRIX_WPSR) Register MASK  (Use MATRIX_WPSR_Msk instead)  */
#define MATRIX_WPSR_Msk                     _U_(0xFFFF01)                                  /**< (MATRIX_WPSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief MATRIX hardware registers */
typedef struct {  
  __IO uint32_t MATRIX_MCFG[3]; /**< (MATRIX Offset: 0x00) Master Configuration Register 0 */
  RoReg8  Reserved1[0x34];
  __IO uint32_t MATRIX_SCFG[4]; /**< (MATRIX Offset: 0x40) Slave Configuration Register 0 */
  RoReg8  Reserved2[0x30];
  __IO uint32_t MATRIX_PRAS0;   /**< (MATRIX Offset: 0x80) Priority Register A for Slave 0 */
  RoReg8  Reserved3[0x4];
  __IO uint32_t MATRIX_PRAS1;   /**< (MATRIX Offset: 0x88) Priority Register A for Slave 1 */
  RoReg8  Reserved4[0x4];
  __IO uint32_t MATRIX_PRAS2;   /**< (MATRIX Offset: 0x90) Priority Register A for Slave 2 */
  RoReg8  Reserved5[0x4];
  __IO uint32_t MATRIX_PRAS3;   /**< (MATRIX Offset: 0x98) Priority Register A for Slave 3 */
  RoReg8  Reserved6[0x78];
  __IO uint32_t CCFG_SYSIO;     /**< (MATRIX Offset: 0x114) System I/O Configuration Register */
  RoReg8  Reserved7[0xCC];
  __IO uint32_t MATRIX_WPMR;    /**< (MATRIX Offset: 0x1E4) Write Protection Mode Register */
  __I  uint32_t MATRIX_WPSR;    /**< (MATRIX Offset: 0x1E8) Write Protection Status Register */
} Matrix;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief MATRIX hardware registers */
typedef struct {  
  __IO MATRIX_MCFG_Type               MATRIX_MCFG[3]; /**< Offset: 0x00 (R/W  32) Master Configuration Register 0 */
  __I  uint32_t                       Reserved1[13];
  __IO MATRIX_SCFG_Type               MATRIX_SCFG[4]; /**< Offset: 0x40 (R/W  32) Slave Configuration Register 0 */
  __I  uint32_t                       Reserved2[12];
  __IO MATRIX_PRAS0_Type              MATRIX_PRAS0;   /**< Offset: 0x80 (R/W  32) Priority Register A for Slave 0 */
  __I  uint32_t                       Reserved3[1];
  __IO MATRIX_PRAS1_Type              MATRIX_PRAS1;   /**< Offset: 0x88 (R/W  32) Priority Register A for Slave 1 */
  __I  uint32_t                       Reserved4[1];
  __IO MATRIX_PRAS2_Type              MATRIX_PRAS2;   /**< Offset: 0x90 (R/W  32) Priority Register A for Slave 2 */
  __I  uint32_t                       Reserved5[1];
  __IO MATRIX_PRAS3_Type              MATRIX_PRAS3;   /**< Offset: 0x98 (R/W  32) Priority Register A for Slave 3 */
  __I  uint32_t                       Reserved6[30];
  __IO CCFG_SYSIO_Type                CCFG_SYSIO;     /**< Offset: 0x114 (R/W  32) System I/O Configuration Register */
  __I  uint32_t                       Reserved7[51];
  __IO MATRIX_WPMR_Type               MATRIX_WPMR;    /**< Offset: 0x1E4 (R/W  32) Write Protection Mode Register */
  __I  MATRIX_WPSR_Type               MATRIX_WPSR;    /**< Offset: 0x1E8 (R/   32) Write Protection Status Register */
} Matrix;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of AHB Bus Matrix */

#endif /* _SAMG53_MATRIX_COMPONENT_H_ */
